#include <stdio.h>
#include <stdlib.h>
#include <windows.h>
int main() {
	SetConsoleOutputCP(1251); //активира кирилицата в конзолата
	int N; //създадохме променлива, в която ще вкараме бройката на редовете и стълбовете
	/*
	* с цикъл do-while ще следим дали въведеното числа за редове и стълбове влизат в интервала [12,16]
	*/
	do
	{
		printf("Въведете броят на редовете и стълбовете (цяло число в интевал [12,16]): ");
		scanf("%d", &N); //въвеждаме стойност цяло число за n от конзолата след горния надпис
	}while(N<12 || N>16);
	/*
	* while(N<12 || N>16); - така следим дали въведеното число не е
	* по-малко от 12 или по-голямо от 16
	* и ако е, ще ни кара да въвеждаме стойност наново, т.е. ще изпълнява цикъла докато
	* не въведем число в интевала от 2 до 6 (т.е. м/у 2 и 6, но без 2 и 6)
	*/

	float A[N][N]; //създаваме двумерен масив - реални числа,който има N на брой редове и N стълбове
	int br=0; //с br ще следим броя на елементите, които отговарят на критерия в точка 2 от заданието
	float sum=0; //в sum ще съберем стойностите на всички елементи от А,
	//които са положителни и над главния диагонал
	printf("\nВъведете елементите на двумерния масив A:\n");
	//следва цикъл в цикъл за обхождане  на целия масив и въвеждане на елементите:
	for(int i=0; i<N; i++)
	{
		for(int j=0; j<N; j++)
		{
			printf("A[%d][%d]= ", i, j); //изписва A[0][0]=, A[0][1]=, A[0][2]= и т.н.
			scanf("%f", &A[i][j]); //въвеждаме стойност за елемент на масива от клавиатурата
			if(A[i][j]==(i+j)) br++; //по точка 2 покачваме br с едно когато въведем такъв елемент
			if(i<j && A[i][j]>0) sum+= A[i][j]; /*когато въведем елемент, който се намира над главния
			*диаглонал и е положителен, добавя стойността му в sum*/
		}
	}
	printf("Сумата на положителните елементи, разположени над гл. диаг. в масив А е: %f", sum);
 	
 	float B[br]; //създаваме масив B с брой елементи равен на br (елементите от А, който отг. на т.2)
 	int index=0; //с index ще следим елементите за масив C, когато им присвояваме елементи от A
 	for(int i=0; i<N; i++)
	{
		for(int j=0; j<N; j++)
		{
			if(A[i][j]==(i+j)) //ако елемента е равен на стойността от сумата на индексите си
			{
				B[index]=A[i][j];
				index++; //след като присвоим стойнсот на B трябва да вдигнем индекса с 1 за сл. ел.
			}
		}
	}
	
	printf("\nМасив B, съдържащ елементите от А, които имат стойност сумата на индексите им:\n");
	for(int i=0; i<br; i++) //цикъл for за обхождане на масив B
	{
		printf("%f\t", B[i]); //принтване стойностите на елементите на масив B таблично - \t
	} printf("\n\n");
	//Когато използваме \n в printf това означава нов ред след него.
	system("pause"); //задържа конзоалта до натискането на клавиш (Press any key to continue . . .)
	return 0;
}


