/*
 * Даден е двумерен масив A[N,M], където N,M са цели числа в интервала [2,4] и се въвеждат от клавиатурата.
 * Да се състави програма, която въвежда елементите на масива и реализира следното:
 * 1. Намира максималната стойност на елемент от масива
 * 2. Променя масив A, като заменя всичките му отрицателни елементи с числото 77
 * 3. Извежда на екрана променения масив в табличен вид
 */

#include <stdio.h>
#include <stdlib.h>
#include <windows.h>

int main()
{
 	SetConsoleOutputCP(1251);

	int N, M;
	do
	{ 	printf("Въведете броят на редовете (цяло число в интевал [2,4]): ");
		scanf("%d", &N);
	}while(N<2 || N>4);
	do
	{ 	printf("Въведете броят на стълбовете (цяло число в интевал [2,4]): ");
		scanf("%d", &M);
	}while(M<2 || M>4);

	float A[N][M];
	printf("\nВъведете елементите на двумерния масив A:\n");
	for(int i=0; i<N; i++)
	{ 	for(int j=0; j<M; j++)
		{ 	printf("A[%d][%d]= ", i, j);
			scanf("%f", &A[i][j]);
		}
	}

	float max=A[0][0];
	for(int i=0; i<N; i++)
	{ 	for(int j=0; j<M; j++)
		{
			if(A[i][j]>max) max=A[i][j];
		}
	}
	printf("\nМаксималната стойност на елемент от масива е равна на %f\n", max);
	
	for(int i=0; i<N; i++)
	{ 	for(int j=0; j<M; j++)
		{
		 	if(A[i][j]<0) A[i][j]=77;
		}
	}
	
	printf("\nПромененият масив A изглежда така:\n");
	for(int i=0; i<N; i++)
	{ 	for(int j=0; j<M; j++)
		{
			printf("%f\t", A[i][j]);
		}
		printf("\n");
	}

	printf("\n\n");
	system("pause");
	return 0;
}



